Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelNotPlanar Property
 Analytical Panel is not planar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalPanelNotPlanar { get; }
Public Shared ReadOnly Property AnalyticalPanelNotPlanar As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalPanelNotPlanar {
	FailureDefinitionId^ get ();
}
static member AnalyticalPanelNotPlanar : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace